---
kind: enumMember
id: F:Autodesk.Revit.DB.Visibility.Invisible
enum: Autodesk.Revit.DB.Visibility
source: html/0927cebc-d2fc-3411-26d7-1927f3b68e09.htm
---
# Autodesk.Revit.DB.Visibility.Invisible

The geometry object is never visible. This type of geometry is never returned by
 Geometry[Options] but may be obtained by other
API operations.